# Merge Function

In [2]:
import pandas as pd

temp = pd.DataFrame({
    'city' : ['mumbai' , 'delhi' , 'bangalore'],
    'temperature' : [32, 45, 30],
} , index = [0,1,2])
temp

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [9]:
humid = pd.DataFrame({
    'city' : ['delhi' , 'mumbai', 'bangalore' , 'pune'],
    'humidity' : [23, 41 , 32 , 47]
} , index = [1,0,2 , 3])
humid

        city  humidity
1      delhi        23
0     mumbai        41
2  bangalore        32
3       pune        47

In [11]:
pd.merge(temp , humid , on = "city")

        city  temperature  humidity
0     mumbai           32        41
1      delhi           45        23
2  bangalore           30        32

In [12]:
pd.merge(temp , humid , on = "city" , how = "outer")

        city  temperature  humidity
0  bangalore         30.0        32
1      delhi         45.0        23
2     mumbai         32.0        41
3       pune          NaN        47

In [13]:
pd.merge(temp , humid , on = "city" , how = "left")

        city  temperature  humidity
0     mumbai           32        41
1      delhi           45        23
2  bangalore           30        32

In [14]:
pd.merge(temp , humid , on = "city" , how = "right")

        city  temperature  humidity
0      delhi         45.0        23
1     mumbai         32.0        41
2  bangalore         30.0        32
3       pune          NaN        47

In [15]:
pd.merge(temp , humid , on = "city" , how = "outer" , indicator = True)

        city  temperature  humidity      _merge
0  bangalore         30.0        32        both
1      delhi         45.0        23        both
2     mumbai         32.0        41        both
3       pune          NaN        47  right_only

In [25]:
df3 = pd.DataFrame({
    'city' : ['pune' , 'latur' , 'mumbai'],
    'temperature' : [2 , 2 ,50]
})
df3

     city  temperature
0    pune            2
1   latur            2
2  mumbai           50

In [26]:
df4 = pd.DataFrame({
    'city' : ['pune' , 'latur' , 'calcutta'],
    'temperature' : [29 , 32 ,53]
})
df4

       city  temperature
0      pune           29
1     latur           32
2  calcutta           53

In [27]:
df5 = pd.merge(df3 , df4 , on = 'city')
df5

    city  temperature_x  temperature_y
0   pune              2             29
1  latur              2             32